[{
    "slug": "algoritmos-y-datos",
    "title": "Algoritmos y Estructuras de Datos",
    "subTitle": "Curso de Algoritmos",
    "content": "Aplicación web que recomienda personas, temas o productos usando árboles de decisión o estructuras tipo árbol binario de búsqueda, mostrando las sugerencias en burbujas interactivas tipo Facebook (como cuando ves sugerencias de amigos o reacciones).",
    "details": [
        {
            "title": "Nodo",
            "content": "Categoría/interés ej. 'Tecnología'."
        },
        {
            "title": "🛠️ Tecnologías Stack",
            "content": "Next.js + React + TailwindCSS Frontend (tipo Facebook)."
        },
        {
            "title": "🧪 Ejemplo de Árbol de Sugerencias Arbol.js",
            "content": "{ valor: Tecnología, izquierda: { valor: Videojuegos, izquierda: null, derecha: null }, derecha: { valor: Inteligencia Artificial, izquierda: null, derecha: null } } 🎨 Interfaz tipo burbuja Cada sugerencia aparece como una burbuja animada flotante (reacción estilo Facebook)."
        },
        {
            "title": "🔁 Funcionalidad principal",
            "content": "Insertar/interactuar con sugerencias (simula likes, vistas, entre otros.)."
        }
    ]
},
{
    "slug": "avamar",
    "title": "Avamar: Solución de Respaldo y Recuperación de Datos",
    "subTitle": "Informe de Mantenimiento de Infraestructura Hyper-V y Dell Avamar",
    "content": "Infraestructuras: Hyper-V con Avamar Dell Backup, VMWare con Avamar Dell Backup.",
    "details": [
        {
            "title": "Aspectos ",
            "content": "Seguridad y Cumplimiento: Las nuevas versiones del cliente incorporan parches de seguridad que protegen contra vulnerabilidades conocidas, asegurando que la solución de respaldo no represente un vector de ataque en la infraestructura."
        },
        {
            "title": "Arquitectura del Cliente Avamar en Entorno Hyper-V",
            "content": "Enfoque Basado en Host Utiliza el Avamar VADP, Enfoque Basado en Guest."
        },
        {
            "title": "Fases",
            "content": "Fase de Preparación, Fase de Implementación y Fase de Validación."
        },
        {
            "title": " Consideraciones Específicas",
            "content": "CBT ,Integración con VSS (Volume Shadow Copy Service), Respaldos Activo, Alta Disponibilidad (HA), Modo de Proxy."
        },
        {
            "title": "Mejores Práctica",
            "content": "Actualización Incremental, Documentación Detallada,Entorno de Pruebas,Sincronización con Avamar Server y Plan de Rollback."
        }
    ]
},
{
    "slug": "blog",
    "title": "Blog Personal",
    "subTitle": "Hoja de vida",
    "content": "Detalles de lo que soy y ha lo que me dedico como Ingeniero en Sistemas.",
    "details": [
        {
            "title": "Experiencia Profesional",
            "content": "Infraestructura Hyperv,Infraestructura VMWare, OFFICE 365, Azure, Administrador de Servidores Senior, Consultor TI, Encargado de TI."
        },
        {
            "title": "Desarrollo Web",
            "content": "Creación de aplicaciones web modernas y responsivas, Experiencia con frameworks como Astro y Next.js"
        },
        {
            "title": "Habilidades Técnicas",
            "content": "Lenguajes de Programación: JavaScript, HTML, CSS; Frameworks y Librerías: Astro, React, Next.js, TypeScript; Control de Versiones: Git, Metodologías Ágiles (Scrum)."
        },
        {
            "title": "Contacto y Redes Profesionales",
            "content": " GitHub: https://github.com/SergioGaray13, Correo Profesional: sergio7garay@gmail.com, Portafolio: https://projectcard-dy9.pages.dev."
        }
    ]
},
{
    "slug": "compiladores",
    "title": "Proyecto Compiladores",
    "subTitle": "Lex y Yacc (Linux)",
    "content": "Se desarrollará un intérprete que recibe como entrada varias expresiones aritméticas y presenta como salida el resultado de dichas expresiones.",
    "details": [
        {
            "title": "🛠️ Tecnologías Stack",
            "content": "Lex: Generador de analizadores léxicos ,Yacc: Generador de analizadores sintácticos, Ubuntu 20.04: Sistema operativo, Visual Studio Code: Editor de código fuente, C: Lenguaje de programación."
        },
        {
            "title": "Prerequisitos",
            "content": "Compilador GCC, Visual Studio Code (o cualquier editor de texto de nuestro agrado)."
        },
        {
            "title": "Crear nuestro proyecto",
            "content": "Creamos un nuevo folder el cual será nuestro espacio de trabajo, para crearlo abrimos una terminal y ejecutamos el comando mkdir ProyectoLexYacc."
        },
        {
            "title": "Fuentes Consultadas",
            "content": "Compiladores, principios, técnicas y herramientas. Aho, Lam, Sethi y Ullman. Segunda Edición."
        }
    ]
},
{
    "slug": "portafolio",
    "title": "Portafolio Personal",
    "subTitle": "🧠 Sistemas Expertos",
    "content": "Este repositorio forma parte de mi portafolio personal y presenta un proyecto de Sistemas Expertos desarrollado como parte de mis estudios en Ingeniería en Sistemas.",
    "details": [
        {
            "title": "📌Descripción del Proyecto",
            "content": "El sistema experto fue diseñado para [https://projectcard-dy9.pages.dev, por ejemplo: proyectos, blogs, portafolio, curriculum u hoja de vida, entre otros.]. Utiliza una base de conocimientos y un motor de inferencia para proporcionar respuestas lógicas en función de las reglas establecidas."
        },
        {
            "title": "🚀 Funcionalidades",
            "content": "✅ Interfaz amigable para el usuario, 📚 Base de conocimientos editable, 🔍 Razonamiento lógico basado en reglas, 🧩 Motor de inferencia hacia adelante y/o hacia atrás, 📝 Explicación del razonamiento del sistema."
        },
        {
            "title": "🛠️ Tecnologías Utilizadas",
            "content": "Lenguaje: Next.js / Astro / TypeScript; Frameworks: Tailwind CSS, Markdown; Herramientas: Cloudflare Pages, VSCode; Otros: Web Component, CSS, JSON."
        },
        {
            "title": "📂 Estructura del Proyecto",
            "content": "📂 mi-portafolio/ ├── 📂 public/ # Archivos estáticos (imágenes, fuentes, favicon, etc.) │ ├── 📂 images/..."
        },
        {
            "title": "Ejecución",
            "content": "Clona este repositorio, Instala las dependencias, Ejecuta el servidor de desarrollo, Abre tu navegador."
        }
    ]
},
{
    "slug": "se-y-terraform",
    "title": "Sistemas Expertos Terraform",
    "subTitle": "Azure y Terraform",
    "content": "Uso de Azure, terraform, Github para el proyecto de Sistemas expertos.",
    "details": [
        {
            "title": "Arquitecturas utlizadas",
            "content": "Servidor para Back Office (API Gateway / Backend), Front-End para vista de usuarios, Front-End para vista de administradores, Base de datos relacional."
        },
        {
            "title": "Servidor para Back Office (API Gateway / Backend)",
            "content": "Se implementa un servidor central que actúa como punto de conexión entre las diferentes vistas del sistema: la interfaz de usuario y la interfaz de administradores."
        },
        {
            "title": "Front-End para vista de usuarios",
            "content": "La interfaz de usuarios se presenta como una aplicación web estática separada, enfocada en ofrecer una experiencia rápida y accesible."
        },
        {
            "title": "Front-End para vista de administradores",
            "content": "La vista de administradores también se implementa como una aplicación separada."
        },
        {
            "title": "Base de datos relacional",
            "content": "El sistema se apoya en una base de datos relacional para almacenar información estructurada y crítica, como datos de usuarios, productos, operaciones y configuraciones del sistema."
        },
        {
            "title": "Base de datos de caché",
            "content": "Se incorpora una base de datos en memoria que actúa como sistema de caché para mejorar el rendimiento en operaciones repetitivas o consultas muy demandadas."
        },
        {
            "title": "Blob Storage",
            "content": "El Blob Storage se utiliza para almacenar archivos grandes y no estructurados como imágenes, documentos o recursos multimedia."
        },
        {
            "title": "Queue Storage",
            "content": "El Queue Storage permite implementar un mecanismo de comunicación asíncrona entre componentes."
        },
        {
            "title": "CDN (Content Delivery Network)",
            "content": "El CDN distribuye el contenido estático (como archivos JS, CSS e imágenes) a través de una red de servidores ubicados globalmente."
        },
        {
            "title": "Azure Functions",
            "content": "Las Azure Functions permiten ejecutar tareas específicas bajo demanda, sin necesidad de mantener un servidor encendido constantemente."
        }
    ]
}
]
